xml/request/netmusik_bibzoom.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns1="http://oss.dbc.dk/ns/openformat" xmlns:os="http://oss.dbc.dk/ns/opensearch" xmlns:dc="http://purl.org/dc/elements/1.1/" xmlns:dkabm="http://biblstandard.dk/abm/namespace/dkabm/" xmlns:ISO639-2="http://lcweb.loc.gov/standards/iso639-2/" xmlns:dcmitype="http://purl.org/dc/dcmitype/" xmlns:dcterms="http://purl.org/dc/terms/" xmlns:ac="http://biblstandard.dk/ac/namespace/" xmlns:dkdcplus="http://biblstandard.dk/abm/namespace/dkdcplus/" xmlns:oss="http://oss.dbc.dk/ns/osstypes" xmlns:marcx="info:lc/xmlns/marcxchange-v1" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
  <SOAP-ENV:Body>
    <ns1:formatRequest>
      <ns1:originalData>
        <os:collection>
          <os:resultPosition>1</os:resultPosition>
          <os:numberOfObjects>1</os:numberOfObjects>
          <os:object>
  <dkabm:record>
    <ac:identifier>0000000000046404|150014</ac:identifier>
    <ac:source>Bibzoom (album)</ac:source>
    <dc:title>Greatest Hits</dc:title>
    <dc:title xsi:type="dkdcplus:full">Greatest Hits</dc:title>
    <dc:creator xsi:type="dkdcplus:mus">The Tourists</dc:creator>
    <dc:creator xsi:type="oss:sort">The Tourists</dc:creator>
    <dc:subject xsi:type="dkdcplus:genre">pop</dc:subject>
    <dc:date>1997</dc:date>
    <dc:publisher>RCA Camden</dc:publisher>
    <dc:contributor xsi:type="dkdcplus:cmp">Ivor Raymonde</dc:contributor>
    <dc:contributor xsi:type="dkdcplus:cmp">Mike Hawker</dc:contributor>
    <dc:contributor xsi:type="dkdcplus:cmp">David A. Stewart</dc:contributor>
    <dc:contributor xsi:type="dkdcplus:cmp">Peter Coombes</dc:contributor>
    <dc:contributor xsi:type="dkdcplus:cmp">Annie Lennox</dc:contributor>
    <dc:contributor xsi:type="dkdcplus:prf">The Tourists</dc:contributor>
    <dc:type xsi:type="dkdcplus:BibDK-Type">Musik (net)</dc:type>
    <dc:rights>(p) 1997 Sony Music Entertainment Inc.</dc:rights>
    <dc:identifier xsi:type="dcterms:URI">http://www.bibzoom.dk/cgi-bin/WebObjects/TShop.woa/wa/PSShop/MusicCollection?sku=0000000000046404</dc:identifier>
    <dcterms:extent>12:54</dcterms:extent>
    <dc:identifier xsi:type="dkdcplus:UPC">743215238126</dc:identifier>
    <dcterms:hasPart xsi:type="dkdcplus:track">&lt;a href="http://www.bibzoom.dk/cgi-bin/WebObjects/TShop.woa/wa/PSShop/Track?sku=0000000000046406"&gt;I Only Want To Be With You&lt;/a&gt;</dcterms:hasPart>
    <dcterms:hasPart xsi:type="dkdcplus:track">&lt;a href="http://www.bibzoom.dk/cgi-bin/WebObjects/TShop.woa/wa/PSShop/Track?sku=0000000000046408"&gt;The Loneliest Man In The World&lt;/a&gt;</dcterms:hasPart>
    <dcterms:hasPart xsi:type="dkdcplus:track">&lt;a href="http://www.bibzoom.dk/cgi-bin/WebObjects/TShop.woa/wa/PSShop/Track?sku=0000000000046407"&gt;So Good To Be Back Home Again&lt;/a&gt;</dcterms:hasPart>
    <dcterms:hasPart xsi:type="dkdcplus:track">&lt;a href="http://www.bibzoom.dk/cgi-bin/WebObjects/TShop.woa/wa/PSShop/Track?sku=0000000000046409"&gt;Don't Say I Told You So&lt;/a&gt;</dcterms:hasPart>
  </dkabm:record>            <os:identifier>150014-basis:0000000000046404</os:identifier>
            <os:formatsAvailable>
              <os:format>dkabm</os:format>
            </os:formatsAvailable>
          </os:object>
        </os:collection>
      </ns1:originalData>
      <ns1:outputFormat>bibliotekdkFullDisplay</ns1:outputFormat>
    </ns1:formatRequest>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
